console.log("Last updated 2026-03-26 17:35")

// --------------------------------------------------------------------- global: dictionary

/* Old dictionary (reformat):
const dict0 = [[["", "", "1st", "sing.", "pres.", "act.", "ind."], ["τίθημι"]], [["", "", "1st", "sing.", "pres.", "mid.", "ind."], ["τίθεμαι"]], [["", "", "1st", "sing.", "pres.", "pass.", "ind."], ["τίθεμαι"]], [["", "", "1st", "sing.", "fut.", "act.", "ind."], ["θήσω"]], [["", "", "1st", "sing.", "fut.", "mid.", "ind."], ["θήσομαι"]], [["", "", "1st", "sing.", "fut.", "pass.", "ind."], ["τεθήσομαι"]], [["", "", "1st", "sing.", "imperf.", "act.", "ind."], ["ἐτίθην"]], [["", "", "1st", "sing.", "imperf.", "mid.", "ind."], ["ἐτιθέμην"]], [["", "", "1st", "sing.", "imperf.", "pass.", "ind."], ["ἐτιθέμην"]], [["", "", "1st", "sing.", "aor.", "act.", "ind."], ["ἔθηκα"]], [["", "", "1st", "sing.", "aor.", "mid.", "ind."], ["ἔθέμην"]], [["", "", "1st", "sing.", "aor.", "pass.", "ind."], ["ἐτέθην"]], [["", "", "1st", "pl.", "pres.", "act.", "ind."], ["τίθεμεν"]], [["", "", "1st", "pl.", "pres.", "mid.", "ind."], ["τιθέμεθα"]], [["", "", "1st", "pl.", "pres.", "pass.", "ind."], ["τιθέμεθα"]], [["", "", "1st", "pl.", "fut.", "act.", "ind."], ["θήσομεν"]], [["", "", "1st", "pl.", "fut.", "mid.", "ind."], ["θησόμεθα"]], [["", "", "1st", "pl.", "fut.", "pass.", "ind."], ["τεθησόμεθα"]], [["", "", "1st", "pl.", "imperf.", "act.", "ind."], ["ἐτίθεμεν"]], [["", "", "1st", "pl.", "imperf.", "mid.", "ind."], ["ἐτιθέμεθα"]], [["", "", "1st", "pl.", "imperf.", "pass.", "ind."], ["ἐτιθέμεθα"]], [["", "", "1st", "pl.", "aor.", "act.", "ind."], ["ἔθεμεν"]], [["", "", "1st", "pl.", "aor.", "mid.", "ind."], ["ἐθέμεθα"]], [["", "", "1st", "pl.", "aor.", "pass.", "ind."], ["ἐτέθημεν"]], [["", "", "2nd", "sing.", "pres.", "act.", "ind."], ["τίθης"]], [["", "", "2nd", "sing.", "pres.", "mid.", "ind."], ["τίθεσαι"]], [["", "", "2nd", "sing.", "pres.", "pass.", "ind."], ["τίθεσαι"]], [["", "", "2nd", "sing.", "fut.", "act.", "ind."], ["θήσεις"]], [["", "", "2nd", "sing.", "fut.", "mid.", "ind."], ["θήσῃ"]], [["", "", "2nd", "sing.", "fut.", "pass.", "ind."], ["τεθήσῃ"]], [["", "", "2nd", "sing.", "imperf.", "act.", "ind."], ["ἐτίθεις"]], [["", "", "2nd", "sing.", "imperf.", "mid.", "ind."], ["ἐτίθεσο"]], [["", "", "2nd", "sing.", "imperf.", "pass.", "ind."], ["ἐτίθεσο"]], [["", "", "2nd", "sing.", "aor.", "act.", "ind."], ["ἔθηκας"]], [["", "", "2nd", "sing.", "aor.", "mid.", "ind."], ["ἔθου"]], [["", "", "2nd", "sing.", "aor.", "pass.", "ind."], ["ἐτέθης"]], [["", "", "2nd", "pl.", "pres.", "act.", "ind."], ["τίθετε"]], [["", "", "2nd", "pl.", "pres.", "mid.", "ind."], ["τίθεσθε"]], [["", "", "2nd", "pl.", "pres.", "pass.", "ind."], ["τίθεσθε"]], [["", "", "2nd", "pl.", "fut.", "act.", "ind."], ["θήσετε"]], [["", "", "2nd", "pl.", "fut.", "mid.", "ind."], ["θήσεσθε"]], [["", "", "2nd", "pl.", "fut.", "pass.", "ind."], ["τεθήσεσθε"]], [["", "", "2nd", "pl.", "imperf.", "act.", "ind."], ["ἐτίθετε"]], [["", "", "2nd", "pl.", "imperf.", "mid.", "ind."], ["ἐτίθεσθε"]], [["", "", "2nd", "pl.", "imperf.", "pass.", "ind."], ["ἐτίθεσθε"]], [["", "", "2nd", "pl.", "aor.", "act.", "ind."], ["ἔθετε"]], [["", "", "2nd", "pl.", "aor.", "mid.", "ind."], ["ἔθεσθε"]], [["", "", "2nd", "pl.", "aor.", "pass.", "ind."], ["ἐτέθητε"]], [["", "", "3rd", "sing.", "pres.", "act.", "ind."], ["τίθησι(ν)"]], [["", "", "3rd", "sing.", "pres.", "mid.", "ind."], ["τίθεται"]], [["", "", "3rd", "sing.", "pres.", "pass.", "ind."], ["τίθεται"]], [["", "", "3rd", "sing.", "fut.", "act.", "ind."], ["θήσει"]], [["", "", "3rd", "sing.", "fut.", "mid.", "ind."], ["θήσεται"]], [["", "", "3rd", "sing.", "fut.", "pass.", "ind."], ["τεθήσεται"]], [["", "", "3rd", "sing.", "imperf.", "act.", "ind."], ["ἐτίθει"]], [["", "", "3rd", "sing.", "imperf.", "mid.", "ind."], ["ἐτίθετο"]], [["", "", "3rd", "sing.", "imperf.", "pass.", "ind."], ["ἐτίθετο"]], [["", "", "3rd", "sing.", "aor.", "act.", "ind."], ["ἔθηκε(ν)"]], [["", "", "3rd", "sing.", "aor.", "mid.", "ind."], ["ἔθετο"]], [["", "", "3rd", "sing.", "aor.", "pass.", "ind."], ["ἐτέθη"]], [["", "", "3rd", "pl.", "pres.", "act.", "ind."], ["τιθέασι(ν)"]], [["", "", "3rd", "pl.", "pres.", "mid.", "ind."], ["τίθενται"]], [["", "", "3rd", "pl.", "pres.", "pass.", "ind."], ["τίθενται"]], [["", "", "3rd", "pl.", "fut.", "act.", "ind."], ["θήσουσι(ν)"]], [["", "", "3rd", "pl.", "fut.", "mid.", "ind."], ["θήσονται"]], [["", "", "3rd", "pl.", "fut.", "pass.", "ind."], ["τεθήσονται"]], [["", "", "3rd", "pl.", "imperf.", "act.", "ind."], ["ἐτίθεσαν"]], [["", "", "3rd", "pl.", "imperf.", "mid.", "ind."], ["ἐτίθεντο"]], [["", "", "3rd", "pl.", "imperf.", "pass.", "ind."], ["ἐτίθεντο"]], [["", "", "3rd", "pl.", "aor.", "act.", "ind."], ["ἔθεσαν"]], [["", "", "3rd", "pl.", "aor.", "mid.", "ind."], ["ἔθεντο"]], [["", "", "3rd", "pl.", "aor.", "pass.", "ind."], ["ἐτέθησαν"]]];
const dict1 = [[["", "", "1st", "sing.", "pres.", "act.", "ind."], ["δίδωμι"]], [["", "", "1st", "sing.", "pres.", "mid.", "ind."], ["δίδομαι"]], [["", "", "1st", "sing.", "pres.", "pass.", "ind."], ["δίδομαι"]], [["", "", "1st", "sing.", "fut.", "act.", "ind."], ["δώσω"]], [["", "", "1st", "sing.", "fut.", "mid.", "ind."], ["δώσομαι"]], [["", "", "1st", "sing.", "fut.", "pass.", "ind."], ["δοθήσομαι"]], [["", "", "1st", "sing.", "imperf.", "act.", "ind."], ["ἐδίδουν"]], [["", "", "1st", "sing.", "imperf.", "mid.", "ind."], ["ἐδιδόμην"]], [["", "", "1st", "sing.", "imperf.", "pass.", "ind."], ["ἐδιδόμην"]], [["", "", "1st", "sing.", "aor.", "act.", "ind."], ["ἔδωκα"]], [["", "", "1st", "sing.", "aor.", "mid.", "ind."], ["ἐδόμην"]], [["", "", "1st", "sing.", "aor.", "pass.", "ind."], ["ἐδόθην"]], [["", "", "1st", "pl.", "pres.", "act.", "ind."], ["δίδομεν"]], [["", "", "1st", "pl.", "pres.", "mid.", "ind."], ["διδόμεθα"]], [["", "", "1st", "pl.", "pres.", "pass.", "ind."], ["διδόμεθα"]], [["", "", "1st", "pl.", "fut.", "act.", "ind."], ["δώσομεν"]], [["", "", "1st", "pl.", "fut.", "mid.", "ind."], ["δωσόμεθα"]], [["", "", "1st", "pl.", "fut.", "pass.", "ind."], ["δοθησόμεθα"]], [["", "", "1st", "pl.", "imperf.", "act.", "ind."], ["ἐδίδομεν"]], [["", "", "1st", "pl.", "imperf.", "mid.", "ind."], ["ἐδιδόμεθα"]], [["", "", "1st", "pl.", "imperf.", "pass.", "ind."], ["ἐδιδόμεθα"]], [["", "", "1st", "pl.", "aor.", "act.", "ind."], ["ἔδομεν"]], [["", "", "1st", "pl.", "aor.", "mid.", "ind."], ["ἐδόμεθα"]], [["", "", "1st", "pl.", "aor.", "pass.", "ind."], ["ἐδόθημεν"]], [["", "", "2nd", "sing.", "pres.", "act.", "ind."], ["δίδως"]], [["", "", "2nd", "sing.", "pres.", "mid.", "ind."], ["δίδοσαι"]], [["", "", "2nd", "sing.", "pres.", "pass.", "ind."], ["δίδοσαι"]], [["", "", "2nd", "sing.", "fut.", "act.", "ind."], ["δώσεις"]], [["", "", "2nd", "sing.", "fut.", "mid.", "ind."], ["δώσεται"]], [["", "", "2nd", "sing.", "fut.", "pass.", "ind."], ["δοθήσεται"]], [["", "", "2nd", "sing.", "imperf.", "act.", "ind."], ["ἐδίδους"]], [["", "", "2nd", "sing.", "imperf.", "mid.", "ind."], ["ἐδίδοσο"]], [["", "", "2nd", "sing.", "imperf.", "pass.", "ind."], ["ἐδίδοσο"]], [["", "", "2nd", "sing.", "aor.", "act.", "ind."], ["ἔδωκας"]], [["", "", "2nd", "sing.", "aor.", "mid.", "ind."], ["ἔδου"]], [["", "", "2nd", "sing.", "aor.", "pass.", "ind."], ["ἐδόθης"]], [["", "", "2nd", "pl.", "pres.", "act.", "ind."], ["δίδοτε"]], [["", "", "2nd", "pl.", "pres.", "mid.", "ind."], ["δίδοσθε"]], [["", "", "2nd", "pl.", "pres.", "pass.", "ind."], ["δίδοσθε"]], [["", "", "2nd", "pl.", "fut.", "act.", "ind."], ["δώσετε"]], [["", "", "2nd", "pl.", "fut.", "mid.", "ind."], ["δώσεσθε"]], [["", "", "2nd", "pl.", "fut.", "pass.", "ind."], ["δοθήσεσθε"]], [["", "", "2nd", "pl.", "imperf.", "act.", "ind."], ["ἐδίδοτε"]], [["", "", "2nd", "pl.", "imperf.", "mid.", "ind."], ["ἐδίδοσθε"]], [["", "", "2nd", "pl.", "imperf.", "pass.", "ind."], ["ἐδίδοσθε"]], [["", "", "2nd", "pl.", "aor.", "act.", "ind."], ["ἔδοτε"]], [["", "", "2nd", "pl.", "aor.", "mid.", "ind."], ["ἔδοσθε"]], [["", "", "2nd", "pl.", "aor.", "pass.", "ind."], ["ἐδόθητε"]], [["", "", "3rd", "sing.", "pres.", "act.", "ind."], ["δίδωσι(ν)"]], [["", "", "3rd", "sing.", "pres.", "mid.", "ind."], ["δίδοται"]], [["", "", "3rd", "sing.", "pres.", "pass.", "ind."], ["δίδοται"]], [["", "", "3rd", "sing.", "fut.", "act.", "ind."], ["δώσει"]], [["", "", "3rd", "sing.", "fut.", "mid.", "ind."], ["δώσεται"]], [["", "", "3rd", "sing.", "fut.", "pass.", "ind."], ["δοθήσεται"]], [["", "", "3rd", "sing.", "imperf.", "act.", "ind."], ["ἐδίδου"]], [["", "", "3rd", "sing.", "imperf.", "mid.", "ind."], ["ἐδίδοτο"]], [["", "", "3rd", "sing.", "imperf.", "pass.", "ind."], ["έδίδοτο"]], [["", "", "3rd", "sing.", "aor.", "act.", "ind."], ["ἔδωκε(ν)"]], [["", "", "3rd", "sing.", "aor.", "mid.", "ind."], ["ἔδοτο"]], [["", "", "3rd", "sing.", "aor.", "pass.", "ind."], ["ἐδόθη"]], [["", "", "3rd", "pl.", "pres.", "act.", "ind."], ["διδόασι(ν)"]], [["", "", "3rd", "pl.", "pres.", "mid.", "ind."], ["δίδονται"]], [["", "", "3rd", "pl.", "pres.", "pass.", "ind."], ["δίδονται"]], [["", "", "3rd", "pl.", "fut.", "act.", "ind."], ["δώσουσι(ν)"]], [["", "", "3rd", "pl.", "fut.", "mid.", "ind."], ["δώσονται"]], [["", "", "3rd", "pl.", "fut.", "pass.", "ind."], ["δοθήσονται"]], [["", "", "3rd", "pl.", "imperf.", "act.", "ind."], ["ἐδίδοσαν"]], [["", "", "3rd", "pl.", "imperf.", "mid.", "ind."], ["ἐδίδοντο"]], [["", "", "3rd", "pl.", "imperf.", "pass.", "ind."], ["ἐδίδοντο"]], [["", "", "3rd", "pl.", "aor.", "act.", "ind."], ["ἔδοσαν"]], [["", "", "3rd", "pl.", "aor.", "mid.", "ind."], ["ἔδοντο"]], [["", "", "3rd", "pl.", "aor.", "pass.", "ind."], ["ἐδόθησαν"]]];
const dict2 = [[["", "", "1st", "sing.", "pres.", "act.", "ind."], ["λύω"]], [["", "", "1st", "sing.", "pres.", "mid.", "ind."], ["λύομαι"]], [["", "", "1st", "sing.", "pres.", "pass.", "ind."], ["λύομαι"]], [["", "", "1st", "sing.", "fut.", "act.", "ind."], ["λύσω"]], [["", "", "1st", "sing.", "fut.", "mid.", "ind."], ["λύσομαι"]], [["", "", "1st", "sing.", "fut.", "pass.", "ind."], ["λυθήσομαι"]], [["", "", "1st", "sing.", "imperf.", "act.", "ind."], ["ἔλυον"]], [["", "", "1st", "sing.", "imperf.", "mid.", "ind."], ["ἐλυόμην"]], [["", "", "1st", "sing.", "imperf.", "pass.", "ind."], ["ἐλυόμην"]], [["", "", "1st", "sing.", "aor.", "act.", "ind."], ["ἔλυσα"]], [["", "", "1st", "sing.", "aor.", "mid.", "ind."], ["ἐλυσάμην"]], [["", "", "1st", "sing.", "aor.", "pass.", "ind."], ["ἐλύθην"]], [["", "", "1st", "pl.", "pres.", "act.", "ind."], ["λύομεν"]], [["", "", "1st", "pl.", "pres.", "mid.", "ind."], ["λυόμεθα"]], [["", "", "1st", "pl.", "pres.", "pass.", "ind."], ["λυόμεθα"]], [["", "", "1st", "pl.", "fut.", "act.", "ind."], ["λύσομεν"]], [["", "", "1st", "pl.", "fut.", "mid.", "ind."], ["λυσόμεθα"]], [["", "", "1st", "pl.", "fut.", "pass.", "ind."], ["λυθησόμεθα"]], [["", "", "1st", "pl.", "imperf.", "act.", "ind."], ["ἐλύομεν"]], [["", "", "1st", "pl.", "imperf.", "mid.", "ind."], ["ἐλυόμεθα"]], [["", "", "1st", "pl.", "imperf.", "pass.", "ind."], ["ἐλυόμεθα"]], [["", "", "1st", "pl.", "aor.", "act.", "ind."], ["ἐλύσαμεν"]], [["", "", "1st", "pl.", "aor.", "mid.", "ind."], ["ἐλυσάμεθα"]], [["", "", "1st", "pl.", "aor.", "pass.", "ind."], ["ἐλύθημεν"]], [["", "", "2nd", "sing.", "pres.", "act.", "ind."], ["λύεις"]], [["", "", "2nd", "sing.", "pres.", "mid.", "ind."], ["λύῃ"]], [["", "", "2nd", "sing.", "pres.", "pass.", "ind."], ["λύῃ"]], [["", "", "2nd", "sing.", "fut.", "act.", "ind."], ["λύσεις"]], [["", "", "2nd", "sing.", "fut.", "mid.", "ind."], ["λύσῃ"]], [["", "", "2nd", "sing.", "fut.", "pass.", "ind."], ["λυθήσῃ"]], [["", "", "2nd", "sing.", "imperf.", "act.", "ind."], ["ἔλυες"]], [["", "", "2nd", "sing.", "imperf.", "mid.", "ind."], ["ἐλύου"]], [["", "", "2nd", "sing.", "imperf.", "pass.", "ind."], ["ἐλύου"]], [["", "", "2nd", "sing.", "aor.", "act.", "ind."], ["ἔλυσας"]], [["", "", "2nd", "sing.", "aor.", "mid.", "ind."], ["ἐλύσω"]], [["", "", "2nd", "sing.", "aor.", "pass.", "ind."], ["ἐλύθης"]], [["", "", "2nd", "pl.", "pres.", "act.", "ind."], ["λύετε"]], [["", "", "2nd", "pl.", "pres.", "mid.", "ind."], ["λύεσθε"]], [["", "", "2nd", "pl.", "pres.", "pass.", "ind."], ["λύεσθε"]], [["", "", "2nd", "pl.", "fut.", "act.", "ind."], ["λύσετε"]], [["", "", "2nd", "pl.", "fut.", "mid.", "ind."], ["λύσεσθε"]], [["", "", "2nd", "pl.", "fut.", "pass.", "ind."], ["λυθήσεσθε"]], [["", "", "2nd", "pl.", "imperf.", "act.", "ind."], ["ἐλύετε"]], [["", "", "2nd", "pl.", "imperf.", "mid.", "ind."], ["ἐλύεσθε"]], [["", "", "2nd", "pl.", "imperf.", "pass.", "ind."], ["ἐλύεσθε"]], [["", "", "2nd", "pl.", "aor.", "act.", "ind."], ["ἐλύσατε"]], [["", "", "2nd", "pl.", "aor.", "mid.", "ind."], ["ἐλύσασθε"]], [["", "", "2nd", "pl.", "aor.", "pass.", "ind."], ["ἔλυθητε"]], [["", "", "3rd", "sing.", "pres.", "act.", "ind."], ["λύει"]], [["", "", "3rd", "sing.", "pres.", "mid.", "ind."], ["λύεται"]], [["", "", "3rd", "sing.", "pres.", "pass.", "ind."], ["λύεται"]], [["", "", "3rd", "sing.", "fut.", "act.", "ind."], ["λύσει"]], [["", "", "3rd", "sing.", "fut.", "mid.", "ind."], ["λύσεται"]], [["", "", "3rd", "sing.", "fut.", "pass.", "ind."], ["λυθήσεται"]], [["", "", "3rd", "sing.", "imperf.", "act.", "ind."], ["ἔλυε(ν)"]], [["", "", "3rd", "sing.", "imperf.", "mid.", "ind."], ["ἐλύετο"]], [["", "", "3rd", "sing.", "imperf.", "pass.", "ind."], ["ἐλύετο"]], [["", "", "3rd", "sing.", "aor.", "act.", "ind."], ["ἔλυσε(ν)"]], [["", "", "3rd", "sing.", "aor.", "mid.", "ind."], ["ἐλύσατο"]], [["", "", "3rd", "sing.", "aor.", "pass.", "ind."], ["ἐλύθη"]], [["", "", "3rd", "pl.", "pres.", "act.", "ind."], ["λύουσθ(ν)"]], [["", "", "3rd", "pl.", "pres.", "mid.", "ind."], ["λύονται"]], [["", "", "3rd", "pl.", "pres.", "pass.", "ind."], ["λύονται"]], [["", "", "3rd", "pl.", "fut.", "act.", "ind."], ["λύσουσι(ν)"]], [["", "", "3rd", "pl.", "fut.", "mid.", "ind."], ["λύσονται"]], [["", "", "3rd", "pl.", "fut.", "pass.", "ind."], ["λυθήσονται"]], [["", "", "3rd", "pl.", "imperf.", "act.", "ind."], ["ἔλυον"]], [["", "", "3rd", "pl.", "imperf.", "mid.", "ind."], ["ἐλύοντο"]], [["", "", "3rd", "pl.", "imperf.", "pass.", "ind."], ["ἐλύοντο"]], [["", "", "3rd", "pl.", "aor.", "act.", "ind."], ["ἔλυσαν"]], [["", "", "3rd", "pl.", "aor.", "mid.", "ind."], ["ἐλύσαντο"]], [["", "", "3rd", "pl.", "aor.", "pass.", "ind."], ["ἐλύθησαν"]]];
const dict3 = [[["", "", "1st", "sing.", "pres.", "act.", "ind."], [""]], [["", "", "1st", "sing.", "pres.", "mid.", "ind."], ["δύναμαι"]], [["", "", "1st", "sing.", "pres.", "pass.", "ind."], [""]], [["", "", "1st", "sing.", "fut.", "act.", "ind."], [""]], [["", "", "1st", "sing.", "fut.", "mid.", "ind."], ["δυνήσομαι"]], [["", "", "1st", "sing.", "fut.", "pass.", "ind."], [""]], [["", "", "1st", "sing.", "imperf.", "act.", "ind."], [""]], [["", "", "1st", "sing.", "imperf.", "mid.", "ind."], ["ἐδυνάμην"]], [["", "", "1st", "sing.", "imperf.", "pass.", "ind."], [""]], [["", "", "1st", "sing.", "aor.", "act.", "ind."], [""]], [["", "", "1st", "sing.", "aor.", "mid.", "ind."], ["ἐδυνήθην"]], [["", "", "1st", "sing.", "aor.", "pass.", "ind."], [""]], [["", "", "1st", "pl.", "pres.", "act.", "ind."], [""]], [["", "", "1st", "pl.", "pres.", "mid.", "ind."], ["δυνάμεθα"]], [["", "", "1st", "pl.", "pres.", "pass.", "ind."], [""]], [["", "", "1st", "pl.", "fut.", "act.", "ind."], [""]], [["", "", "1st", "pl.", "fut.", "mid.", "ind."], ["δυνησόμεθα"]], [["", "", "1st", "pl.", "fut.", "pass.", "ind."], [""]], [["", "", "1st", "pl.", "imperf.", "act.", "ind."], ["ἐδυνάμεθα"]], [["", "", "1st", "pl.", "imperf.", "mid.", "ind."], [""]], [["", "", "1st", "pl.", "imperf.", "pass.", "ind."], [""]], [["", "", "1st", "pl.", "aor.", "act.", "ind."], [""]], [["", "", "1st", "pl.", "aor.", "mid.", "ind."], ["ἐδυνήθημεν"]], [["", "", "1st", "pl.", "aor.", "pass.", "ind."], [""]], [["", "", "2nd", "sing.", "pres.", "act.", "ind."], [""]], [["", "", "2nd", "sing.", "pres.", "mid.", "ind."], ["δύνασαι"]], [["", "", "2nd", "sing.", "pres.", "pass.", "ind."], [""]], [["", "", "2nd", "sing.", "fut.", "act.", "ind."], [""]], [["", "", "2nd", "sing.", "fut.", "mid.", "ind."], ["δυνήσῃ"]], [["", "", "2nd", "sing.", "fut.", "pass.", "ind."], [""]], [["", "", "2nd", "sing.", "imperf.", "act.", "ind."], [""]], [["", "", "2nd", "sing.", "imperf.", "mid.", "ind."], ["ἐδύνασο"]], [["", "", "2nd", "sing.", "imperf.", "pass.", "ind."], [""]], [["", "", "2nd", "sing.", "aor.", "act.", "ind."], [""]], [["", "", "2nd", "sing.", "aor.", "mid.", "ind."], ["ἐδυνήθης"]], [["", "", "2nd", "sing.", "aor.", "pass.", "ind."], [""]], [["", "", "2nd", "pl.", "pres.", "act.", "ind."], [""]], [["", "", "2nd", "pl.", "pres.", "mid.", "ind."], ["δύνασθε"]], [["", "", "2nd", "pl.", "pres.", "pass.", "ind."], [""]], [["", "", "2nd", "pl.", "fut.", "act.", "ind."], [""]], [["", "", "2nd", "pl.", "fut.", "mid.", "ind."], ["δυνήσεσθε"]], [["", "", "2nd", "pl.", "fut.", "pass.", "ind."], [""]], [["", "", "2nd", "pl.", "imperf.", "act.", "ind."], [""]], [["", "", "2nd", "pl.", "imperf.", "mid.", "ind."], ["ἐδύνασθε"]], [["", "", "2nd", "pl.", "imperf.", "pass.", "ind."], [""]], [["", "", "2nd", "pl.", "aor.", "act.", "ind."], [""]], [["", "", "2nd", "pl.", "aor.", "mid.", "ind."], ["ἐδυνήθητε"]], [["", "", "2nd", "pl.", "aor.", "pass.", "ind."], [""]], [["", "", "3rd", "sing.", "pres.", "act.", "ind."], [""]], [["", "", "3rd", "sing.", "pres.", "mid.", "ind."], ["δύναται"]], [["", "", "3rd", "sing.", "pres.", "pass.", "ind."], [""]], [["", "", "3rd", "sing.", "fut.", "act.", "ind."], [""]], [["", "", "3rd", "sing.", "fut.", "mid.", "ind."], ["δυνήσεται"]], [["", "", "3rd", "sing.", "fut.", "pass.", "ind."], [""]], [["", "", "3rd", "sing.", "imperf.", "act.", "ind."], [""]], [["", "", "3rd", "sing.", "imperf.", "mid.", "ind."], ["ἐδύνατο"]], [["", "", "3rd", "sing.", "imperf.", "pass.", "ind."], [""]], [["", "", "3rd", "sing.", "aor.", "act.", "ind."], [""]], [["", "", "3rd", "sing.", "aor.", "mid.", "ind."], ["ἐδυνήθη"]], [["", "", "3rd", "sing.", "aor.", "pass.", "ind."], [""]], [["", "", "3rd", "pl.", "pres.", "act.", "ind."], [""]], [["", "", "3rd", "pl.", "pres.", "mid.", "ind."], ["δύνανται"]], [["", "", "3rd", "pl.", "pres.", "pass.", "ind."], [""]], [["", "", "3rd", "pl.", "fut.", "act.", "ind."], [""]], [["", "", "3rd", "pl.", "fut.", "mid.", "ind."], ["δυνήσονται"]], [["", "", "3rd", "pl.", "fut.", "pass.", "ind."], [""]], [["", "", "3rd", "pl.", "imperf.", "act.", "ind."], [""]], [["", "", "3rd", "pl.", "imperf.", "mid.", "ind."], ["ἐδύναντο"]], [["", "", "3rd", "pl.", "imperf.", "pass.", "ind."], [""]], [["", "", "3rd", "pl.", "aor.", "act.", "ind."], [""]], [["", "", "3rd", "pl.", "aor.", "mid.", "ind."], ["ἐδυνήθησαν"]], [["", "", "3rd", "pl.", "aor.", "pass.", "ind."], [""]]];
*/

const dict4 = [[["", "", "1st", "sing.", "pres.", "act.", "ind."], ["ἵστημι"]], [["", "", "2nd", "sing.", "pres.", "act.", "ind."], ["ἵστης"]], [["", "", "3rd", "sing.", "pres.", "act.", "ind."], ["ἵστησι(ν)"]], [["", "", "1st", "pl.", "pres.", "act.", "ind."], ["ἵσταμεν"]], [["", "", "2nd", "pl.", "pres.", "act.", "ind."], ["ἵστατε"]], [["", "", "3rd", "pl.", "pres.", "act.", "ind."], ["ἱστᾶσι(ν)"]], [["", "", "1st", "sing.", "pres.", "mid.", "ind."], ["ἵσταμαι"]], [["", "", "2nd", "sing.", "pres.", "mid.", "ind."], ["ἵστασαι"]], [["", "", "3rd", "sing.", "pres.", "mid.", "ind."], ["ἵσταται"]], [["", "", "1st", "pl.", "pres.", "mid.", "ind."], ["ἱστάμεθα"]], [["", "", "2nd", "pl.", "pres.", "mid.", "ind."], ["ἵστασθε"]], [["", "", "3rd", "pl.", "pres.", "mid.", "ind."], ["ἵστανται"]], [["", "", "1st", "sing.", "pres.", "pass.", "ind."], ["ἵσταμαι"]], [["", "", "2nd", "sing.", "pres.", "pass.", "ind."], ["ἵστασαι"]], [["", "", "3rd", "sing.", "pres.", "pass.", "ind."], ["ἵσταται"]], [["", "", "1st", "pl.", "pres.", "pass.", "ind."], ["ἱστάμεθα"]], [["", "", "2nd", "pl.", "pres.", "pass.", "ind."], ["ἵστασθε"]], [["", "", "3rd", "pl.", "pres.", "pass.", "ind."], ["ἵστανται"]], [["", "", "1st", "sing.", "fut.", "act.", "ind."], ["στήσω"]], [["", "", "2nd", "sing.", "fut.", "act.", "ind."], ["στήσεις"]], [["", "", "3rd", "sing.", "fut.", "act.", "ind."], ["στήσει"]], [["", "", "1st", "pl.", "fut.", "act.", "ind."], ["στήσομεν"]], [["", "", "2nd", "pl.", "fut.", "act.", "ind."], ["στήσετε"]], [["", "", "3rd", "pl.", "fut.", "act.", "ind."], ["στήσουσι(ν)"]], [["", "", "1st", "sing.", "fut.", "mid.", "ind."], ["στήσομαι"]], [["", "", "2nd", "sing.", "fut.", "mid.", "ind."], ["στήσῃ"]], [["", "", "3rd", "sing.", "fut.", "mid.", "ind."], ["στήσεται"]], [["", "", "1st", "pl.", "fut.", "mid.", "ind."], ["στησόμεθα"]], [["", "", "2nd", "pl.", "fut.", "mid.", "ind."], ["στήσεσθε"]], [["", "", "3rd", "pl.", "fut.", "mid.", "ind."], ["στήσονται"]], [["", "", "1st", "sing.", "fut.", "pass.", "ind."], ["σταθήσομαι"]], [["", "", "2nd", "sing.", "fut.", "pass.", "ind."], ["σταθήσῃ"]], [["", "", "3rd", "sing.", "fut.", "pass.", "ind."], ["σταθήσεται"]], [["", "", "1st", "pl.", "fut.", "pass.", "ind."], ["σταθησόμεθα"]], [["", "", "2nd", "pl.", "fut.", "pass.", "ind."], ["σταθήσεσθε"]], [["", "", "3rd", "pl.", "fut.", "pass.", "ind."], ["σταθήσονται"]], [["", "", "1st", "sing.", "imperf.", "act.", "ind."], ["ἵστην"]], [["", "", "2nd", "sing.", "imperf.", "act.", "ind."], ["ἵστης"]], [["", "", "3rd", "sing.", "imperf.", "act.", "ind."], ["ἵστη"]], [["", "", "1st", "pl.", "imperf.", "act.", "ind."], ["ἵσταμεν"]], [["", "", "2nd", "pl.", "imperf.", "act.", "ind."], ["ἵστατε"]], [["", "", "3rd", "pl.", "imperf.", "act.", "ind."], ["ἵστασαν"]], [["", "", "1st", "sing.", "imperf.", "mid.", "ind."], ["ἱστάμην"]], [["", "", "2nd", "sing.", "imperf.", "mid.", "ind."], ["ἵστασο"]], [["", "", "3rd", "sing.", "imperf.", "mid.", "ind."], ["ἵστατο"]], [["", "", "1st", "pl.", "imperf.", "mid.", "ind."], ["ἱστάμεθα"]], [["", "", "2nd", "pl.", "imperf.", "mid.", "ind."], ["ἵστασθε"]], [["", "", "3rd", "pl.", "imperf.", "mid.", "ind."], ["ἵσταντο"]], [["", "", "1st", "sing.", "imperf.", "pass.", "ind."], ["ἱστάμην"]], [["", "", "2nd", "sing.", "imperf.", "pass.", "ind."], ["ἵστασο"]], [["", "", "3rd", "sing.", "imperf.", "pass.", "ind."], ["ἵστατο"]], [["", "", "1st", "pl.", "imperf.", "pass.", "ind."], ["ἱστάμεθα"]], [["", "", "2nd", "pl.", "imperf.", "pass.", "ind."], ["ἵστασθε"]], [["", "", "3rd", "pl.", "imperf.", "pass.", "ind."], ["ἵσταντο"]], [["", "", "1st", "sing.", "aor.", "act.", "ind."], ["ἔστησα"]], [["", "", "2nd", "sing.", "aor.", "act.", "ind."], ["ἔστησας"]], [["", "", "3rd", "sing.", "aor.", "act.", "ind."], ["ἔστησε(ν)"]], [["", "", "1st", "pl.", "aor.", "act.", "ind."], ["ἐστήσαμεν"]], [["", "", "2nd", "pl.", "aor.", "act.", "ind."], ["ἐστήσατε"]], [["", "", "3rd", "pl.", "aor.", "act.", "ind."], ["ἔστησαν"]], [["", "", "1st", "sing.", "aor.", "mid.", "ind."], ["ἐστησάμην"]], [["", "", "2nd", "sing.", "aor.", "mid.", "ind."], ["ἐστήσω"]], [["", "", "3rd", "sing.", "aor.", "mid.", "ind."], ["ἐστήσατο"]], [["", "", "1st", "pl.", "aor.", "mid.", "ind."], ["ἐστησάμεθα"]], [["", "", "2nd", "pl.", "aor.", "mid.", "ind."], ["ἐστήσασθε"]], [["", "", "3rd", "pl.", "aor.", "mid.", "ind."], ["ἐστήσαντο"]], [["", "", "1st", "sing.", "aor.", "pass.", "ind."], ["ἐστάθην"]], [["", "", "2nd", "sing.", "aor.", "pass.", "ind."], ["ἐστάθης"]], [["", "", "3rd", "sing.", "aor.", "pass.", "ind."], ["ἐστάθη"]], [["", "", "1st", "pl.", "aor.", "pass.", "ind."], ["ἐστάθημεν"]], [["", "", "2nd", "pl.", "aor.", "pass.", "ind."], ["ἐστάθητε"]], [["", "", "3rd", "pl.", "aor.", "pass.", "ind."], ["ἐστάθησαν"]], [["", "", "2nd", "sing.", "pres.", "act.", "imp."], ["ἵστη"]], [["", "", "2nd", "pl.", "pres.", "act.", "imp."], ["ἵστατε"]], [["", "", "2nd", "sing.", "pres.", "mid.", "imp."], ["ἵστασο"]], [["", "", "2nd", "pl.", "pres.", "mid.", "imp."], ["ἵστασθε"]], [["", "", "2nd", "sing.", "pres.", "pass.", "imp."], ["ἵστασο"]], [["", "", "2nd", "pl.", "pres.", "pass.", "imp."], ["ἵστασθε"]], [["", "", "2nd", "sing.", "fut.", "act.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "act.", "imp."], [""]], [["", "", "2nd", "sing.", "fut.", "mid.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "mid.", "imp."], [""]], [["", "", "2nd", "sing.", "fut.", "pass.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "pass.", "imp."], [""]], [["", "", "2nd", "sing.", "aor.", "act.", "imp."], ["στῆσον"]], [["", "", "2nd", "pl.", "aor.", "act.", "imp."], ["στήσατε"]], [["", "", "2nd", "sing.", "aor.", "mid.", "imp."], ["στῆσαι"]], [["", "", "2nd", "pl.", "aor.", "mid.", "imp."], ["στήσασθε"]], [["", "", "2nd", "sing.", "aor.", "pass.", "imp."], ["στάθητι"]], [["", "", "2nd", "pl.", "aor.", "pass.", "imp."], ["στάθητε"]], [["", "", "", "", "pres.", "act.", "inf."], ["ἱστάναι"]], [["", "", "", "", "pres.", "mid.", "inf."], ["ἵστασθαι"]], [["", "", "", "", "pres.", "pass.", "inf."], ["ἵστασθαι"]], [["", "", "", "", "fut.", "act.", "inf."], ["στήσειν"]], [["", "", "", "", "fut.", "mid.", "inf."], ["στήσεσθαι"]], [["", "", "", "", "fut.", "pass.", "inf."], ["στήσεσθαι"]], [["", "", "", "", "aor.", "act.", "inf."], ["στῆσαι"]], [["", "", "", "", "aor.", "mid.", "inf."], ["στήσασθαι"]], [["", "", "", "", "aor.", "pass.", "inf."], ["σταθῆναι"]], [["m.", "nom.", "", "sing.", "pres.", "act.", "part."], ["ἱστάς"]], [["f.", "nom.", "", "sing.", "pres.", "act.", "part."], ["ἱστᾶσα"]], [["n.", "nom.", "", "sing.", "pres.", "act.", "part."], ["ἱστάν"]], [["m.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["ἱστάμενος"]], [["f.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["ἱσταμένη"]], [["n.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["ἱστάμενον"]], [["m.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["ἱστάμενος"]], [["f.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["ἱσταμένη"]], [["n.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["ἱστάμενον"]], [["m.", "nom.", "", "sing.", "fut.", "act.", "part."], ["στήσων"]], [["f.", "nom.", "", "sing.", "fut.", "act.", "part."], ["στήσουσα"]], [["n.", "nom.", "", "sing.", "fut.", "act.", "part."], ["στῆσον"]], [["m.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["στησόμενος"]], [["f.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["στησομένη"]], [["n.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["στησόμενον"]], [["m.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["στηθησόμενος"]], [["f.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["στηθησομένη"]], [["n.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["στηθησόμενον"]], [["m.", "nom.", "", "sing.", "aor.", "act.", "part."], ["στήσας"]], [["f.", "nom.", "", "sing.", "aor.", "act.", "part."], ["στήσασα"]], [["n.", "nom.", "", "sing.", "aor.", "act.", "part."], ["στῆσαν"]], [["m.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["στησάμενος"]], [["f.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["στησαμένη"]], [["n.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["στησάμενον"]], [["m.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["σταθείς"]], [["f.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["σταθεῖσα"]], [["n.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["σταθέν"]]];
const dict5 = [[["", "", "1st", "sing.", "pres.", "act.", "ind."], ["δείκνυμι"]], [["", "", "2nd", "sing.", "pres.", "act.", "ind."], ["δείκνυς"]], [["", "", "3rd", "sing.", "pres.", "act.", "ind."], ["δείκνυσι(ν)"]], [["", "", "1st", "pl.", "pres.", "act.", "ind."], ["δείκνυμεν"]], [["", "", "2nd", "pl.", "pres.", "act.", "ind."], ["δείκνυτε"]], [["", "", "3rd", "pl.", "pres.", "act.", "ind."], ["δεικνύασι(ν)"]], [["", "", "1st", "sing.", "pres.", "mid.", "ind."], ["δείκνυμαι"]], [["", "", "2nd", "sing.", "pres.", "mid.", "ind."], ["δείκνυσαι"]], [["", "", "3rd", "sing.", "pres.", "mid.", "ind."], ["δείκνυται"]], [["", "", "1st", "pl.", "pres.", "mid.", "ind."], ["δεικνύμεθα"]], [["", "", "2nd", "pl.", "pres.", "mid.", "ind."], ["δείκνυσθε"]], [["", "", "3rd", "pl.", "pres.", "mid.", "ind."], ["δείκνυνται"]], [["", "", "1st", "sing.", "pres.", "pass.", "ind."], ["δείκνυμαι"]], [["", "", "2nd", "sing.", "pres.", "pass.", "ind."], ["δείκνυσαι"]], [["", "", "3rd", "sing.", "pres.", "pass.", "ind."], ["δείκνυται"]], [["", "", "1st", "pl.", "pres.", "pass.", "ind."], ["δεικνύμεθα"]], [["", "", "2nd", "pl.", "pres.", "pass.", "ind."], ["δείκνυσθε"]], [["", "", "3rd", "pl.", "pres.", "pass.", "ind."], ["δείκνυνται"]], [["", "", "1st", "sing.", "fut.", "act.", "ind."], ["δείξω"]], [["", "", "2nd", "sing.", "fut.", "act.", "ind."], ["δείξεις"]], [["", "", "3rd", "sing.", "fut.", "act.", "ind."], ["δείξει"]], [["", "", "1st", "pl.", "fut.", "act.", "ind."], ["δείξομεν"]], [["", "", "2nd", "pl.", "fut.", "act.", "ind."], ["δείξετε"]], [["", "", "3rd", "pl.", "fut.", "act.", "ind."], ["δείξουσι(ν)"]], [["", "", "1st", "sing.", "fut.", "mid.", "ind."], ["δείξομαι"]], [["", "", "2nd", "sing.", "fut.", "mid.", "ind."], ["δείξῃ"]], [["", "", "3rd", "sing.", "fut.", "mid.", "ind."], ["δείξεται"]], [["", "", "1st", "pl.", "fut.", "mid.", "ind."], ["δειξόμεθα"]], [["", "", "2nd", "pl.", "fut.", "mid.", "ind."], ["δείξεσθε"]], [["", "", "3rd", "pl.", "fut.", "mid.", "ind."], ["δείξονται"]], [["", "", "1st", "sing.", "fut.", "pass.", "ind."], ["δειχθήσομαι"]], [["", "", "2nd", "sing.", "fut.", "pass.", "ind."], ["δειχθήσῃ"]], [["", "", "3rd", "sing.", "fut.", "pass.", "ind."], ["δειχθήσεται"]], [["", "", "1st", "pl.", "fut.", "pass.", "ind."], ["δειχθησόμεθα"]], [["", "", "2nd", "pl.", "fut.", "pass.", "ind."], ["δειχθήσεσθε"]], [["", "", "3rd", "pl.", "fut.", "pass.", "ind."], ["δειχθήσονται"]], [["", "", "1st", "sing.", "imperf.", "act.", "ind."], ["ἐδείκνυν"]], [["", "", "2nd", "sing.", "imperf.", "act.", "ind."], ["ἐδείκνυς"]], [["", "", "3rd", "sing.", "imperf.", "act.", "ind."], ["ἐδείκνυ"]], [["", "", "1st", "pl.", "imperf.", "act.", "ind."], ["ἐδείκνυμεν"]], [["", "", "2nd", "pl.", "imperf.", "act.", "ind."], ["ἐδείκνυτε"]], [["", "", "3rd", "pl.", "imperf.", "act.", "ind."], ["ἐδείκνυσαν"]], [["", "", "1st", "sing.", "imperf.", "mid.", "ind."], ["ἐδεικνύμην"]], [["", "", "2nd", "sing.", "imperf.", "mid.", "ind."], ["ἐδείκνυσο"]], [["", "", "3rd", "sing.", "imperf.", "mid.", "ind."], ["ἐδείκνυτο"]], [["", "", "1st", "pl.", "imperf.", "mid.", "ind."], ["ἐδεικνύμεθα"]], [["", "", "2nd", "pl.", "imperf.", "mid.", "ind."], ["ἐδείκνυσθε"]], [["", "", "3rd", "pl.", "imperf.", "mid.", "ind."], ["ἐδείνυντο"]], [["", "", "1st", "sing.", "imperf.", "pass.", "ind."], ["ἐδεικνύμην"]], [["", "", "2nd", "sing.", "imperf.", "pass.", "ind."], ["ἐδείκνυσο"]], [["", "", "3rd", "sing.", "imperf.", "pass.", "ind."], ["ἐδείκνυτο"]], [["", "", "1st", "pl.", "imperf.", "pass.", "ind."], ["ἐδεικνύμεθα"]], [["", "", "2nd", "pl.", "imperf.", "pass.", "ind."], ["ἐδείκνυσθε"]], [["", "", "3rd", "pl.", "imperf.", "pass.", "ind."], ["ἐδείνυντο"]], [["", "", "1st", "sing.", "aor.", "act.", "ind."], ["ἔδειξα"]], [["", "", "2nd", "sing.", "aor.", "act.", "ind."], ["ἔδειξας"]], [["", "", "3rd", "sing.", "aor.", "act.", "ind."], ["ἔδειξε(ν)"]], [["", "", "1st", "pl.", "aor.", "act.", "ind."], ["ἐδείξαμεν"]], [["", "", "2nd", "pl.", "aor.", "act.", "ind."], ["ἐδείξατε"]], [["", "", "3rd", "pl.", "aor.", "act.", "ind."], ["ἔδειξαν"]], [["", "", "1st", "sing.", "aor.", "mid.", "ind."], ["ἐδειξάμην"]], [["", "", "2nd", "sing.", "aor.", "mid.", "ind."], ["ἐδείξω"]], [["", "", "3rd", "sing.", "aor.", "mid.", "ind."], ["ἐδείξατο"]], [["", "", "1st", "pl.", "aor.", "mid.", "ind."], ["ἐδειξάμεθα"]], [["", "", "2nd", "pl.", "aor.", "mid.", "ind."], ["ἐδείξασθε"]], [["", "", "3rd", "pl.", "aor.", "mid.", "ind."], ["ἐδείξαντο"]], [["", "", "1st", "sing.", "aor.", "pass.", "ind."], ["ἐδείχθην"]], [["", "", "2nd", "sing.", "aor.", "pass.", "ind."], ["ἐδείχθης"]], [["", "", "3rd", "sing.", "aor.", "pass.", "ind."], ["ἐδείχθη"]], [["", "", "1st", "pl.", "aor.", "pass.", "ind."], ["ἐδείχθημεν"]], [["", "", "2nd", "pl.", "aor.", "pass.", "ind."], ["ἐδείχθητε"]], [["", "", "3rd", "pl.", "aor.", "pass.", "ind."], ["ἐδείχθησαν"]], [["", "", "2nd", "sing.", "pres.", "act.", "imp."], ["δείκνυ"]], [["", "", "2nd", "pl.", "pres.", "act.", "imp."], ["δείκνυτε"]], [["", "", "2nd", "sing.", "pres.", "mid.", "imp."], ["δείκνυσο"]], [["", "", "2nd", "pl.", "pres.", "mid.", "imp."], ["δείκνυσθε"]], [["", "", "2nd", "sing.", "pres.", "pass.", "imp."], ["δείκνυσο"]], [["", "", "2nd", "pl.", "pres.", "pass.", "imp."], ["δείκνυσθε"]], [["", "", "2nd", "sing.", "fut.", "act.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "act.", "imp."], [""]], [["", "", "2nd", "sing.", "fut.", "mid.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "mid.", "imp."], [""]], [["", "", "2nd", "sing.", "fut.", "pass.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "pass.", "imp."], [""]], [["", "", "2nd", "sing.", "aor.", "act.", "imp."], ["δεῖξον"]], [["", "", "2nd", "pl.", "aor.", "act.", "imp."], ["δείξατε"]], [["", "", "2nd", "sing.", "aor.", "mid.", "imp."], ["δεῖξαι"]], [["", "", "2nd", "pl.", "aor.", "mid.", "imp."], ["δείξασθε"]], [["", "", "2nd", "sing.", "aor.", "pass.", "imp."], ["δείχθητι"]], [["", "", "2nd", "pl.", "aor.", "pass.", "imp."], ["δείχθητε"]], [["", "", "", "", "pres.", "act.", "inf."], ["δεικνύναι"]], [["", "", "", "", "pres.", "mid.", "inf."], ["δείκνυσθαι"]], [["", "", "", "", "pres.", "pass.", "inf."], ["δείκνυσθαι"]], [["", "", "", "", "fut.", "act.", "inf."], ["δείξειν"]], [["", "", "", "", "fut.", "mid.", "inf."], ["δείξεσθαι"]], [["", "", "", "", "fut.", "pass.", "inf."], ["δειχθήσεσθαι"]], [["", "", "", "", "aor.", "act.", "inf."], ["δεῖξαι"]], [["", "", "", "", "aor.", "mid.", "inf."], ["δείξασθαι"]], [["", "", "", "", "aor.", "pass.", "inf."], ["δειχθῆναι"]], [["m.", "nom.", "", "sing.", "pres.", "act.", "part."], ["δεικνύς"]], [["f.", "nom.", "", "sing.", "pres.", "act.", "part."], ["δεικνῦσα"]], [["n.", "nom.", "", "sing.", "pres.", "act.", "part."], ["δεικνύν"]], [["m.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["δεικνύμενος"]], [["f.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["δεικνυμένη"]], [["n.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["δεικνύμενον"]], [["m.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["δεικνύμενος"]], [["f.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["δεικνυμένη"]], [["n.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["δεικνύμενον"]], [["m.", "nom.", "", "sing.", "fut.", "act.", "part."], ["δείξων"]], [["f.", "nom.", "", "sing.", "fut.", "act.", "part."], ["δείξουσα"]], [["n.", "nom.", "", "sing.", "fut.", "act.", "part."], ["δεῖξον"]], [["m.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["δειξόμενος"]], [["f.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["δειξομένη"]], [["n.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["δειξόμενον"]], [["m.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["δειχθησόμενος"]], [["f.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["δειχθησομένη"]], [["n.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["δειχθησόμενον"]], [["m.", "nom.", "", "sing.", "aor.", "act.", "part."], ["δείξας"]], [["f.", "nom.", "", "sing.", "aor.", "act.", "part."], ["δείξασα"]], [["n.", "nom.", "", "sing.", "aor.", "act.", "part."], ["δεῖξαν"]], [["m.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["δειξάμενος"]], [["f.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["δειξαμένη"]], [["n.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["δειξάμενον"]], [["m.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["δειχθείς"]], [["f.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["δειχθεῖσα"]], [["n.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["δειχθέν"]]];
const dict6 = [[["", "", "1st", "sing.", "pres.", "act.", "ind."], ["ἵημι"]], [["", "", "2nd", "sing.", "pres.", "act.", "ind."], ["ἵης"]], [["", "", "3rd", "sing.", "pres.", "act.", "ind."], ["ἵησι(ν)"]], [["", "", "1st", "pl.", "pres.", "act.", "ind."], ["ἵεμεν"]], [["", "", "2nd", "pl.", "pres.", "act.", "ind."], ["ἵετε"]], [["", "", "3rd", "pl.", "pres.", "act.", "ind."], ["ἱᾶσι(ν)"]], [["", "", "1st", "sing.", "pres.", "mid.", "ind."], ["ἵεμαι"]], [["", "", "2nd", "sing.", "pres.", "mid.", "ind."], ["ἵεσαι"]], [["", "", "3rd", "sing.", "pres.", "mid.", "ind."], ["ἵεται"]], [["", "", "1st", "pl.", "pres.", "mid.", "ind."], ["ἱέμεθα"]], [["", "", "2nd", "pl.", "pres.", "mid.", "ind."], ["ἵεσθε"]], [["", "", "3rd", "pl.", "pres.", "mid.", "ind."], ["ἵενται"]], [["", "", "1st", "sing.", "pres.", "pass.", "ind."], ["ἵεμαι"]], [["", "", "2nd", "sing.", "pres.", "pass.", "ind."], ["ἵεσαι"]], [["", "", "3rd", "sing.", "pres.", "pass.", "ind."], ["ἵεται"]], [["", "", "1st", "pl.", "pres.", "pass.", "ind."], ["ἱέμεθα"]], [["", "", "2nd", "pl.", "pres.", "pass.", "ind."], ["ἵεσθε"]], [["", "", "3rd", "pl.", "pres.", "pass.", "ind."], ["ἵενται"]], [["", "", "1st", "sing.", "fut.", "act.", "ind."], ["ἥσω"]], [["", "", "2nd", "sing.", "fut.", "act.", "ind."], ["ἥσεις"]], [["", "", "3rd", "sing.", "fut.", "act.", "ind."], ["ἥσει"]], [["", "", "1st", "pl.", "fut.", "act.", "ind."], ["ἥσομεν"]], [["", "", "2nd", "pl.", "fut.", "act.", "ind."], ["ἥσετε"]], [["", "", "3rd", "pl.", "fut.", "act.", "ind."], ["ἥσουσι(ν)"]], [["", "", "1st", "sing.", "fut.", "mid.", "ind."], ["ἥσομαι"]], [["", "", "2nd", "sing.", "fut.", "mid.", "ind."], ["ἥσῃ"]], [["", "", "3rd", "sing.", "fut.", "mid.", "ind."], ["ἥσεται"]], [["", "", "1st", "pl.", "fut.", "mid.", "ind."], ["ἡσόμεθα"]], [["", "", "2nd", "pl.", "fut.", "mid.", "ind."], ["ἥσεσθε"]], [["", "", "3rd", "pl.", "fut.", "mid.", "ind."], ["ἥσονται"]], [["", "", "1st", "sing.", "fut.", "pass.", "ind."], ["ἑθήσομαι"]], [["", "", "2nd", "sing.", "fut.", "pass.", "ind."], ["ἑθήσῃ"]], [["", "", "3rd", "sing.", "fut.", "pass.", "ind."], ["ἑθήσεται"]], [["", "", "1st", "pl.", "fut.", "pass.", "ind."], ["ἑθησόμεθα"]], [["", "", "2nd", "pl.", "fut.", "pass.", "ind."], ["ἑθήσεσθε"]], [["", "", "3rd", "pl.", "fut.", "pass.", "ind."], ["ἑθήσονται"]], [["", "", "1st", "sing.", "imperf.", "act.", "ind."], ["ἵην"]], [["", "", "2nd", "sing.", "imperf.", "act.", "ind."], ["ἵεις"]], [["", "", "3rd", "sing.", "imperf.", "act.", "ind."], ["ἵει"]], [["", "", "1st", "pl.", "imperf.", "act.", "ind."], ["ἵεμεν"]], [["", "", "2nd", "pl.", "imperf.", "act.", "ind."], ["ἵετε"]], [["", "", "3rd", "pl.", "imperf.", "act.", "ind."], ["ἵεσαν"]], [["", "", "1st", "sing.", "imperf.", "mid.", "ind."], ["ἱέμην"]], [["", "", "2nd", "sing.", "imperf.", "mid.", "ind."], ["ἵεσο"]], [["", "", "3rd", "sing.", "imperf.", "mid.", "ind."], ["ἵετο"]], [["", "", "1st", "pl.", "imperf.", "mid.", "ind."], ["ἱέμεθα"]], [["", "", "2nd", "pl.", "imperf.", "mid.", "ind."], ["ἵεσθε"]], [["", "", "3rd", "pl.", "imperf.", "mid.", "ind."], ["ἵεντο"]], [["", "", "1st", "sing.", "imperf.", "pass.", "ind."], ["ἱέμην"]], [["", "", "2nd", "sing.", "imperf.", "pass.", "ind."], ["ἵεσο"]], [["", "", "3rd", "sing.", "imperf.", "pass.", "ind."], ["ἵετο"]], [["", "", "1st", "pl.", "imperf.", "pass.", "ind."], ["ἱέμεθα"]], [["", "", "2nd", "pl.", "imperf.", "pass.", "ind."], ["ἵεσθε"]], [["", "", "3rd", "pl.", "imperf.", "pass.", "ind."], ["ἵεντο"]], [["", "", "1st", "sing.", "aor.", "act.", "ind."], ["ἧκα"]], [["", "", "2nd", "sing.", "aor.", "act.", "ind."], ["ἧκας"]], [["", "", "3rd", "sing.", "aor.", "act.", "ind."], ["ἧκε(ν)"]], [["", "", "1st", "pl.", "aor.", "act.", "ind."], ["εἷμεν"]], [["", "", "2nd", "pl.", "aor.", "act.", "ind."], ["εἷτε"]], [["", "", "3rd", "pl.", "aor.", "act.", "ind."], ["εἷσαν"]], [["", "", "1st", "sing.", "aor.", "mid.", "ind."], ["εἵμην"]], [["", "", "2nd", "sing.", "aor.", "mid.", "ind."], ["εἷσο"]], [["", "", "3rd", "sing.", "aor.", "mid.", "ind."], ["εἷτο"]], [["", "", "1st", "pl.", "aor.", "mid.", "ind."], ["εἵμεθα"]], [["", "", "2nd", "pl.", "aor.", "mid.", "ind."], ["εἷσθε"]], [["", "", "3rd", "pl.", "aor.", "mid.", "ind."], ["εἷντο"]], [["", "", "1st", "sing.", "aor.", "pass.", "ind."], ["εἵθην"]], [["", "", "2nd", "sing.", "aor.", "pass.", "ind."], ["εἵθης"]], [["", "", "3rd", "sing.", "aor.", "pass.", "ind."], ["εἵθη"]], [["", "", "1st", "pl.", "aor.", "pass.", "ind."], ["εἵθημεν"]], [["", "", "2nd", "pl.", "aor.", "pass.", "ind."], ["εἵθητε"]], [["", "", "3rd", "pl.", "aor.", "pass.", "ind."], ["εἵθησαν"]], [["", "", "2nd", "sing.", "pres.", "act.", "imp."], ["ἵει"]], [["", "", "2nd", "pl.", "pres.", "act.", "imp."], ["ἵετε"]], [["", "", "2nd", "sing.", "pres.", "mid.", "imp."], ["ἵεσο"]], [["", "", "2nd", "pl.", "pres.", "mid.", "imp."], ["ἵεσθε"]], [["", "", "2nd", "sing.", "pres.", "pass.", "imp."], ["ἵεσο"]], [["", "", "2nd", "pl.", "pres.", "pass.", "imp."], ["ἵεσθε"]], [["", "", "2nd", "sing.", "fut.", "act.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "act.", "imp."], [""]], [["", "", "2nd", "sing.", "fut.", "mid.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "mid.", "imp."], [""]], [["", "", "2nd", "sing.", "fut.", "pass.", "imp."], [""]], [["", "", "2nd", "pl.", "fut.", "pass.", "imp."], [""]], [["", "", "2nd", "sing.", "aor.", "act.", "imp."], ["ἕς"]], [["", "", "2nd", "pl.", "aor.", "act.", "imp."], ["ἕτε"]], [["", "", "2nd", "sing.", "aor.", "mid.", "imp."], ["οὗ"]], [["", "", "2nd", "pl.", "aor.", "mid.", "imp."], ["ἕσθε"]], [["", "", "2nd", "sing.", "aor.", "pass.", "imp."], ["ἕθητι"]], [["", "", "2nd", "pl.", "aor.", "pass.", "imp."], ["ἕθητε"]], [["", "", "", "", "pres.", "act.", "inf."], ["ἱέναι"]], [["", "", "", "", "pres.", "mid.", "inf."], ["ἵεσθαι"]], [["", "", "", "", "pres.", "pass.", "inf."], ["ἵεσθαι"]], [["", "", "", "", "fut.", "act.", "inf."], ["ἥσειν"]], [["", "", "", "", "fut.", "mid.", "inf."], ["ἥσεσθαι"]], [["", "", "", "", "fut.", "pass.", "inf."], ["ἑθήσεσθαι"]], [["", "", "", "", "aor.", "act.", "inf."], ["εἷναι"]], [["", "", "", "", "aor.", "mid.", "inf."], ["ἕσθαι"]], [["", "", "", "", "aor.", "pass.", "inf."], ["ἑθῆναι"]], [["m.", "nom.", "", "sing.", "pres.", "act.", "part."], ["ἱείς"]], [["f.", "nom.", "", "sing.", "pres.", "act.", "part."], ["ἱεῖσα"]], [["n.", "nom.", "", "sing.", "pres.", "act.", "part."], ["ἱέν"]], [["m.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["ἱέμενος"]], [["f.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["ἱεμένη"]], [["n.", "nom.", "", "sing.", "pres.", "mid.", "part."], ["ἱέμενον"]], [["m.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["ἱέμενος"]], [["f.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["ἱεμένη"]], [["n.", "nom.", "", "sing.", "pres.", "pass.", "part."], ["ἱέμενον"]], [["m.", "nom.", "", "sing.", "fut.", "act.", "part."], ["ἥσων"]], [["f.", "nom.", "", "sing.", "fut.", "act.", "part."], ["ἥσουσα"]], [["n.", "nom.", "", "sing.", "fut.", "act.", "part."], ["ἧσον"]], [["m.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["ἡσόμενος"]], [["f.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["ἡσομένη"]], [["n.", "nom.", "", "sing.", "fut.", "mid.", "part."], ["ἡσόμενον"]], [["m.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["ἑθησόμενος"]], [["f.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["ἑθησομένη"]], [["n.", "nom.", "", "sing.", "fut.", "pass.", "part."], ["ἑθησόμενον"]], [["m.", "nom.", "", "sing.", "aor.", "act.", "part."], ["εἵς"]], [["f.", "nom.", "", "sing.", "aor.", "act.", "part."], ["εἷσα"]], [["n.", "nom.", "", "sing.", "aor.", "act.", "part."], ["ἕν"]], [["m.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["ἕμενος"]], [["f.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["ἑμένη"]], [["n.", "nom.", "", "sing.", "aor.", "mid.", "part."], ["ἕμενον"]], [["m.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["ἑθείς"]], [["f.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["ἑθεῖσα"]], [["n.", "nom.", "", "sing.", "aor.", "pass.", "part."], ["ἑθέν"]]];
const bigDictionary = [dict4, dict5, dict6];

//test dictionary: [[  [ ["1st", "sing", "present"], ["I dive"] ],  [ ["3rd", "sing", "present"], ["she dives"] ],  [ ["", "", "past"], ["dived", "dove"] ],  [ ["", "", "inf"], ["to dive"] ]  ], [  [ ["1st", "sing", "present"], ["I run"] ],  [ ["3rd", "sing", "present"], ["she runs"] ],  [ ["", "", "past"], ["ran"] ],  [ ["", "", "inf"], ["to run"] ]  ], [  [ ["1st", "sing", "present"], ["I can"] ],  [ ["3rd", "sing", "present"], ["she can"] ],  [ ["", "", "past"], ["could"] ]  ]]

// --------------------------------------------------------------------- global: acceptable values

const acceptableValues = [["m.", "f.", "n."], ["nom."], ["1st", "2nd", "3rd"], ["sing.", "pl."], ["pres.", "fut.", "imperf.", "aor."], ["act.", "mid.", "pass."], ["ind.", "imp.", "inf.", "part."]];
  
//testing purposes: [["1st", "3rd"], ["sing"], ["present", "past", "inf"]];

// =
// gender: ["m.", "f.", "n."]
// case: ["nom."]
// person: ["1st", "2nd", "3rd"]
// number: ["sing.", "pl."]
// tense: ["pres.", "fut.", "imperf.", "aor."]
// voice: ["act.", "mid.", "pass."]
// mood: ["ind.", "imp.", "inf.", "part."]

// --------------------------------------------------------------------- other global vars

var currentWord = ""; //top-level entry in the dictionary
var currentQuestion = ""; //sub-entry containing the displayed PROMPT WORD and its hidden INFLECTION DATA
var correctAnswer = ""; //the sub-entry containing the hidden ANSWER WORD and its displayed INFLECTION DATA
var wordUses = 0;
var setting = 0; // 0 = input verbs, 1 = input forms

var recentAnswers = [];

const promptWord = document.getElementById("promptWord");
const promptForm = document.getElementById("promptForm");
const answerBox = document.getElementById("answerBox");
const submitButton = document.getElementById("submitButton");
const feedback = document.getElementById("feedback");

// --------------------------------------------------------------------- defining setting 1

function findAnswerSettingOne() {
  var validAnswersCollected = false;
  var attempts = 0;
  const maxAttempts = currentWord.length*10;

  while (!validAnswersCollected) {
  attempts++;
    
  //const varToChange = Math.floor(Math.random() * currentQuestion[0].length)
  const varToChange = Math.floor((Math.random() * acceptableValues.length));
    console.log("variable to change: " + varToChange);
    console.log(acceptableValues[varToChange]);
  var newValue = currentQuestion[0][varToChange];
  if (acceptableValues[varToChange].length < 2) continue;
  while (newValue == currentQuestion[0][varToChange]) newValue = acceptableValues[varToChange][Math.floor(Math.random() * acceptableValues[varToChange].length)];

  validAnswers = [];
  for (const entry of currentWord) {
    if (entry[0][varToChange] != newValue || entry[1] == "") continue; // the second condition, this is new
    var valid = true;
    for (var j=0; j<entry[0].length; j++) {
      if (j == varToChange) continue;
      if (entry[0][j] == "" || currentQuestion[0][j] == "" || entry[0][j] == currentQuestion[0][j]) continue;
      valid = false;
    }
    if (valid) validAnswers.push(entry);
  }

  var existsNewAnswerLine = false
  for (var i=0; i<validAnswers.length; i++) {
    //replacing if (validAnswer[1] != currentQuestion[1]) existsNewAnswerLine = true;
    var recentlyUsed = false;
    for (const recentAnswer of recentAnswers) if (validAnswers[i][1] == recentAnswer[1]) recentlyUsed = true;
    if (!recentlyUsed) {
      existsNewAnswerLine = true;
    } else {
      var tempArr = [];
      for (var j=0; j<i; j++) tempArr.push(validAnswers[j]);
      for (var j=i+1; j<validAnswers.length; j++) tempArr.push(validAnswers[j]);
      validAnswers = tempArr;
      i--;
    }
  }
  if (validAnswers.length > 0 && existsNewAnswerLine) validAnswersCollected = true;
    
  if (attempts > maxAttempts) {
    validAnswers = [];
    var randomNewAnswer = currentWord[Math.floor(Math.random() * currentWord.length)];
    while (randomNewAnswer[1] == currentQuestion[1]) randomNewAnswer = currentWord[Math.floor(Math.random() * currentWord.length)];
    validAnswers.push(randomNewAnswer);
    break;
  }
}
  
  var tentative = validAnswers[Math.floor(Math.random() * validAnswers.length)];
  
  // ^ replacing while (tentative[1] == currentQuestion[1]) tentative = validAnswers[Math.floor(Math.random() * validAnswers.length)];
  
  correctAnswer = tentative;
  console.log(correctAnswer);
}

function newQuestionSettingOne() {

  //-------------------------------------------------------------------- Setup

  submitButton.setAttribute("onclick", "event.preventDefault(); checkAnswer();")
  submitButton.setAttribute("value", "Check");

  if (setting == 0) {
    feedback.innerText = "Conjugate the verb above in the form provided.";
  } else {
    feedback.innerText = "Identify the form of the verb above.";
  }
  for (var i=0; i<document.getElementsByName("answerBox").length; i++) document.getElementsByName("answerBox")[i].value = "";

  // Math.floor(Math.random() * 10) returns a random int 0 through 9 inclusive
  
  const answerBoxes = document.getElementsByName("answerBox");
  for (let i=1; i<answerBoxes.length; i++) answerBoxes[i].type = "hidden";

  const dictionary = [];
  const toggleSettings = document.getElementsByName("toggle");
  for (var i=0; i<bigDictionary.length; i++) {
    if (toggleSettings[i].checked == true) dictionary.push(bigDictionary[i]);
  }

  if (setting == 0) {
    if (wordUses%3 == 0) {
      var temp = currentWord;
      while (temp == currentWord) temp = dictionary[Math.floor(Math.random() * dictionary.length)]
      currentWord = temp;
      console.log("Word number: " + dictionary.indexOf(currentWord));
  
      recentAnswers = [];
  
      currentQuestion = currentWord[Math.floor(Math.random() * currentWord.length)];
      while (currentQuestion[1] == "") currentQuestion = currentWord[Math.floor(Math.random() * currentWord.length)]; //this is new
    }
    else {
      recentAnswers.push(currentQuestion);
      recentAnswers.push(correctAnswer);
      currentQuestion = correctAnswer;
    }
    wordUses++;
  }

  //-------------------------------------------------------------------- Selecting an answer

  if (setting == 0) {
    findAnswerSettingOne();
  } else {
    const wordIndex = Math.floor(Math.random() * dictionary.length);
    currentWord = dictionary[wordIndex];
    currentQuestion = currentWord[Math.floor(Math.random() * currentWord.length)];
    console.log(currentQuestion);
  
    correctAnswer = [[], []];
    for (const entry of currentWord) if (entry[0] == currentQuestion[0]) correctAnswer[1].push(entry[0]);
    console.log(correctAnswer[1]);
  
    var texto = "";
    for (const entry of correctAnswer[1]) {
      texto = "";
      for (var i=0; i<entry.length; i++) {
        texto += entry[i];
        if (entry[i] != "" && i != entry.length-1) texto += " ";
      }
      console.log(texto);
      correctAnswer[1][correctAnswer[1].indexOf(entry)] = texto;
    }
    console.log(correctAnswer[1])
  }

  //-------------------------------------------------------------------- Display
  
  var promptText = "";
  for (var i=0; i<currentQuestion[1].length-1; i++) {
      promptText += ` ${currentQuestion[1][i]}` + ",";
    }
  promptText += ` ${currentQuestion[1][currentQuestion[1].length-1]}`;
  promptWord.innerText = promptText;
  
  promptText = "";
  if (setting == 0) for (var i=0; i<correctAnswer[0].length; i++) promptText += correctAnswer[0][i] + " ";
  promptForm.innerText = promptText;

}

function checkAnswer() {
  
  //collect inputs
  const inputs = document.getElementsByName("answerBox");
  var userAnswers = [];
  for (var i=0; i<inputs.length; i++) {
    if (inputs[i].value != "") userAnswers.push(inputs[i].value);
  }

  //check to make sure all correct answers were inputted
  var allCorrect = true;
  for (var i=0; i<correctAnswer[1].length; i++) {
    for (var j=0; j<userAnswers.length+1; j++) {
      if (correctAnswer[1][i] == userAnswers[j]) break;
      if (j == userAnswers.length) allCorrect = false;
    }
  }

  //check to make sure no incorrect answers are represented
  var noneWrong = true;
  for (var i=0; i<userAnswers.length; i++) {
    for (var j=0; j<correctAnswer[1].length; j++) {
      if (correctAnswer[1][j] == userAnswers[i]) break;
      if (j == correctAnswer[1].length) noneWrong = false;
    }
  }

  //display feedback
  if (allCorrect && noneWrong) {
    feedback.innerText = "Correct!"
  } else {
    feedback.innerText = "Nope. Correct answer:";
    for (var i=0; i<correctAnswer[1].length-1; i++) {
      feedback.innerText += ` ${correctAnswer[1][i]}` + ",";
    }
    feedback.innerText += ` ${correctAnswer[1][correctAnswer[1].length-1]}`;
  }

  //update button
  submitButton.setAttribute("onclick", "event.preventDefault(); newQuestionSettingOne();")
  submitButton.setAttribute("value", "Next");

}

function addField() {
  const answerBoxes = document.getElementsByName("answerBox");
  for (const box of answerBoxes) {
    if (box.type == "hidden") {
      box.type = "text";
      return;
    }
  }
  alert("No more fields to add!");
}


//page setup

const toggleMenu = document.getElementById("toggles");
for (const word of bigDictionary) {
  const newToggle = toggleMenu.appendChild(document.createElement("input"));
  newToggle.setAttribute("type", "checkbox");
  newToggle.setAttribute("name", "toggle");
  const newLabel = toggleMenu.appendChild(document.createElement("p"));
  newLabel.innerText = word[0][1];
  toggleMenu.appendChild(document.createElement("br"));
}

newQuestionSettingOne();
